<a href="https://colab.research.google.com/github/nath229/My-first-Github-project-with-Eckovation/blob/master/uber_ML.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Topic: Analyze UBER Data in Python Using Machine Learning.

In [328]:
import pandas as pd

In [329]:
data = pd.read_csv('/content/uber_dataset.csv')

In [330]:
data_copy = data.copy()

In [331]:
data_copy.head()

      START_DATE*       END_DATE*  ... MILES*         PURPOSE*
0  1/1/2016 21:11  1/1/2016 21:17  ...    5.1   Meal/Entertain
1   1/2/2016 1:25   1/2/2016 1:37  ...    5.0              NaN
2  1/2/2016 20:25  1/2/2016 20:38  ...    4.8  Errand/Supplies
3  1/5/2016 17:31  1/5/2016 17:45  ...    4.7          Meeting
4  1/6/2016 14:42  1/6/2016 15:49  ...   63.7   Customer Visit

[5 rows x 7 columns]

Dataset samples

In [332]:
data.head()

      START_DATE*       END_DATE*  ... MILES*         PURPOSE*
0  1/1/2016 21:11  1/1/2016 21:17  ...    5.1   Meal/Entertain
1   1/2/2016 1:25   1/2/2016 1:37  ...    5.0              NaN
2  1/2/2016 20:25  1/2/2016 20:38  ...    4.8  Errand/Supplies
3  1/5/2016 17:31  1/5/2016 17:45  ...    4.7          Meeting
4  1/6/2016 14:42  1/6/2016 15:49  ...   63.7   Customer Visit

[5 rows x 7 columns]

Dataset type  information

In [333]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1156 entries, 0 to 1155
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   START_DATE*  1156 non-null   object
 1   END_DATE*    1155 non-null   object
 2   CATEGORY*    1155 non-null   object
 3   START*       1155 non-null   object
 4   STOP*        1155 non-null   object
 5   MILES*       1156 non-null   float64
 6   PURPOSE*     653 non-null    object
dtypes: float64(1), object(6)
memory usage: 63.3+ KB

In [334]:
data.count()

START_DATE*    1156
END_DATE*      1155
CATEGORY*      1155
START*         1155
STOP*          1155
MILES*         1156
PURPOSE*        653
dtype: int64

Dataset description

In [335]:
data.describe()

             MILES*
count   1156.000000
mean      21.115398
std      359.299007
min        0.500000
25%        2.900000
50%        6.000000
75%       10.400000
max    12204.700000

# Data Cleaning

In [336]:
data.isnull().any()

START_DATE*    False
END_DATE*       True
CATEGORY*       True
START*          True
STOP*           True
MILES*         False
PURPOSE*        True
dtype: bool

In [337]:
data["START_DATE*"]

0         1/1/2016 21:11
1          1/2/2016 1:25
2         1/2/2016 20:25
3         1/5/2016 17:31
4         1/6/2016 14:42
              ...
1151    12/31/2016 13:24
1152    12/31/2016 15:03
1153    12/31/2016 21:32
1154    12/31/2016 22:08
1155              Totals
Name: START_DATE*, Length: 1156, dtype: object

1155 row is droped because it is of no use

In [338]:
data = data.drop([1155])

Dataset after drops out the row

In [339]:
data["START_DATE*"]

0         1/1/2016 21:11
1          1/2/2016 1:25
2         1/2/2016 20:25
3         1/5/2016 17:31
4         1/6/2016 14:42
              ...
1150     12/31/2016 1:07
1151    12/31/2016 13:24
1152    12/31/2016 15:03
1153    12/31/2016 21:32
1154    12/31/2016 22:08
Name: START_DATE*, Length: 1155, dtype: object

datetime module for datetime function

In [340]:
from datetime import  datetime

START_TIME* and END_TIME*Column data type is changed from object to datetime64

In [341]:
 data["START_DATE*"] = pd.to_datetime(data["START_DATE*"] )

In [342]:
data['END_DATE*'] = pd.to_datetime(data['END_DATE*'] )

In [343]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1155 entries, 0 to 1154
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   START_DATE*  1155 non-null   datetime64[ns]
 1   END_DATE*    1155 non-null   datetime64[ns]
 2   CATEGORY*    1155 non-null   object
 3   START*       1155 non-null   object
 4   STOP*        1155 non-null   object
 5   MILES*       1155 non-null   float64
 6   PURPOSE*     653 non-null    object
dtypes: datetime64[ns](2), float64(1), object(4)
memory usage: 72.2+ KB

In [344]:
data.count()

START_DATE*    1155
END_DATE*      1155
CATEGORY*      1155
START*         1155
STOP*          1155
MILES*         1155
PURPOSE*        653
dtype: int64

In [345]:
data['END_DATE*'].dt.hour

0       21
1        1
2       20
3       17
4       15
        ..
1150     1
1151    13
1152    15
1153    21
1154    23
Name: END_DATE*, Length: 1155, dtype: int64

# Calculating the travelling time

In [346]:
travel_time = data['END_DATE*'] -  data["START_DATE*"]

In [347]:
dataframe = travel_time.dt.seconds

travel time in seconds

In [348]:
type(dataframe)

pandas.core.series.Series

In [349]:
data.insert(7,'travel_time',dataframe)

In [350]:
data.head(10)

          START_DATE*           END_DATE*  ...         PURPOSE* travel_time
0 2016-01-01 21:11:00 2016-01-01 21:17:00  ...   Meal/Entertain         360
1 2016-01-02 01:25:00 2016-01-02 01:37:00  ...              NaN         720
2 2016-01-02 20:25:00 2016-01-02 20:38:00  ...  Errand/Supplies         780
3 2016-01-05 17:31:00 2016-01-05 17:45:00  ...          Meeting         840
4 2016-01-06 14:42:00 2016-01-06 15:49:00  ...   Customer Visit        4020
5 2016-01-06 17:15:00 2016-01-06 17:19:00  ...   Meal/Entertain         240
6 2016-01-06 17:30:00 2016-01-06 17:35:00  ...          Meeting         300
7 2016-01-07 13:27:00 2016-01-07 13:33:00  ...          Meeting         360
8 2016-01-10 08:05:00 2016-01-10 08:25:00  ...          Meeting        1200
9 2016-01-10 12:17:00 2016-01-10 12:44:00  ...   Customer Visit        1620

[10 rows x 8 columns]

# Calculating the average speed of the trips

In [351]:
data['travel_time'] = data['travel_time']/60

In [352]:
data.head(10)

          START_DATE*           END_DATE*  ...         PURPOSE* travel_time
0 2016-01-01 21:11:00 2016-01-01 21:17:00  ...   Meal/Entertain         6.0
1 2016-01-02 01:25:00 2016-01-02 01:37:00  ...              NaN        12.0
2 2016-01-02 20:25:00 2016-01-02 20:38:00  ...  Errand/Supplies        13.0
3 2016-01-05 17:31:00 2016-01-05 17:45:00  ...          Meeting        14.0
4 2016-01-06 14:42:00 2016-01-06 15:49:00  ...   Customer Visit        67.0
5 2016-01-06 17:15:00 2016-01-06 17:19:00  ...   Meal/Entertain         4.0
6 2016-01-06 17:30:00 2016-01-06 17:35:00  ...          Meeting         5.0
7 2016-01-07 13:27:00 2016-01-07 13:33:00  ...          Meeting         6.0
8 2016-01-10 08:05:00 2016-01-10 08:25:00  ...          Meeting        20.0
9 2016-01-10 12:17:00 2016-01-10 12:44:00  ...   Customer Visit        27.0

[10 rows x 8 columns]

In [353]:
avg_speed = data['MILES*']/data['travel_time']

avg speed miles/min

In [355]:
avg_speed.head(10)

0    0.850000
1    0.416667
2    0.369231
3    0.335714
4    0.950746
5    1.075000
6    1.420000
7    0.133333
8    0.415000
9    0.611111
dtype: float64

In [356]:
data.insert(8,'avg_speed_in_miles/min',avg_speed)

In [357]:
data.head(10)

          START_DATE*           END_DATE*  ... travel_time avg_speed_in_miles/min
0 2016-01-01 21:11:00 2016-01-01 21:17:00  ...         6.0               0.850000
1 2016-01-02 01:25:00 2016-01-02 01:37:00  ...        12.0               0.416667
2 2016-01-02 20:25:00 2016-01-02 20:38:00  ...        13.0               0.369231
3 2016-01-05 17:31:00 2016-01-05 17:45:00  ...        14.0               0.335714
4 2016-01-06 14:42:00 2016-01-06 15:49:00  ...        67.0               0.950746
5 2016-01-06 17:15:00 2016-01-06 17:19:00  ...         4.0               1.075000
6 2016-01-06 17:30:00 2016-01-06 17:35:00  ...         5.0               1.420000
7 2016-01-07 13:27:00 2016-01-07 13:33:00  ...         6.0               0.133333
8 2016-01-10 08:05:00 2016-01-10 08:25:00  ...        20.0               0.415000
9 2016-01-10 12:17:00 2016-01-10 12:44:00  ...        27.0               0.611111

[10 rows x 9 columns]